Tekla Open API Reference for Tekla Structures 2025
WpfOkCreateCancel Class
 Interaction logic for WPFOkCreateCancel.xaml
 WpfOkCreateCancel
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfOkCreateCancel : UserControl,
	IComponentConnector
Public Class WpfOkCreateCancel
	Inherits UserControl
	Implements IComponentConnector
The WpfOkCreateCancel type exposes the following members.
Constructors
Name | Description
WpfOkCreateCancel
 Constructor
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
CreateClicked
 The ApplyClicked event is raised when the Apply button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace